// DISCLAIMER
// 	THIS CODE AND INFORMATION IS PROVIDED "AS IS" WITHOUT WARRANTY OF
// 	ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING BUT NOT LIMITED TO
// 	THE IMPLIED WARRANTIES OF MERCHANTABILITY AND/OR FITNESS FOR A
// 	PARTICULAR PURPOSE.
// 	Copyright (c) Microsoft Corporation. All rights reserved.

AuditLogs
| extend TargetResourceParsed = parse_json(TargetResources)
| where OperationName contains "domain"
| project ActivityDateTime, TargetResourceParsed[0].displayName